OpenFOAM-v2412/tutorials/combustion/fireFoam/LES/flameSpreadWaterSuppressionPanel/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    rho
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       0;
        relTol          0.1;
    };

    rhoFinal
    {
        $rho;
        tolerance       1e-6;
        relTol          0;
    };

    p_rgh
    {
        solver              GAMG;
        tolerance           1e-5;
        relTol              0.01;
        smoother            GaussSeidel;
    };

    p_rghFinal
    {
        solver              GAMG;
        tolerance           1e-6;
        relTol              0;
        smoother            GaussSeidel;
    };

    ph_rgh
    {
        $p_rgh;
    }

    "(U|Yi|h|k)"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-8;
        relTol          0.1;
    };

    "(U|Yi|h|k)Final"
    {
        $U;
        tolerance       1e-8;
        relTol          0;
    };

    Ii
    {
        solver          GAMG;
        tolerance       1e-4;
        relTol          0;
        smoother        DILU;
        maxIter         20;
    }
}

PIMPLE
{
    momentumPredictor yes;
    nOuterCorrectors  1;
    nCorrectors       2;
    nNonOrthogonalCorrectors 0;

    hydrostaticInitialization yes;
    nHydrostaticCorrectors 5;
}

relaxationFactors
{
    equations
    {
        "(U|k).*"                   1;
        "(C3H8|O2|H2O|CO2|h).*"     1;
    }
}


// ************************************************************************* //
